
{
  "what-prompting-is": "# Что такое промптинг\n\nПромптинг - это процесс создания эффективных запросов (промптов) для языковых моделей с целью получения желаемых результатов. Промпт инженеринг - это более широкая область, которая включает разработку, оптимизацию и применение таких запросов.\n\nХороший промпт включает четкие инструкции и контекст, который помогает модели понять, что от нее требуется.",
  "five-step-framework": "# Пятишаговый фреймворк для создания промптов\n\n1. **Определите цель** - точно сформулируйте, что вы хотите получить от модели\n2. **Предоставьте контекст** - дайте модели необходимую информацию для понимания задачи\n3. **Сформулируйте инструкции** - четко объясните, что должна сделать модель\n4. **Укажите формат ответа** - определите, в каком виде вы хотите получить результат\n5. **Проведите итерацию** - тестируйте и улучшайте промпт на основе полученных результатов",
  "personas-in-prompting": "# Персоны в промптинге\n\nИспользование персон в промптах помогает настроить тон и стиль ответа модели. Вы можете попросить модель отвечать в роли определенного эксперта или персонажа, что часто приводит к более структурированным и целенаправленным ответам.\n\nПример: \"Действуй как опытный шеф-повар и предложи рецепт блюда из следующих ингредиентов...\"",
  "iteration-methods": "# Методы итерации промптов\n\nИтерация промптов - это процесс постепенного улучшения запросов на основе полученных результатов. Основные методы:\n\n1. **A/B тестирование** - сравнение двух вариантов промпта\n2. **Постепенное улучшение** - внесение небольших изменений и анализ их влияния\n3. **Расширение контекста** - добавление дополнительной информации\n4. **Уточняющие вопросы** - использование ответов модели для формулирования следующих запросов",
  "multimodal-prompting": "# Мультимодальный промптинг\n\nМультимодальный промптинг включает использование различных типов данных (текст, изображения и т.д.) в одном запросе. Современные модели, такие как GPT-4 Vision, могут обрабатывать текст и изображения вместе, что открывает новые возможности для взаимодействия.\n\nПримеры применения:\n- Анализ диаграмм и графиков\n- Распознавание объектов на изображениях\n- Создание описаний для визуального контента",
  "responsible-ai-use": "# Ответственное использование ИИ\n\nПри работе с языковыми моделями важно соблюдать этические принципы:\n\n1. **Защита персональных данных** - не передавайте чувствительную информацию в промптах\n2. **Прозрачность** - сообщайте пользователям, когда они взаимодействуют с ИИ\n3. **Предотвращение вреда** - избегайте создания контента, который может причинить вред\n4. **Снижение предвзятости** - осознавайте возможные предубеждения в ответах моделей\n\nРазработчики должны стремиться к созданию систем, которые приносят пользу обществу и минимизируют потенциальные риски.",
  "vocabulary": "# Словарь терминов промпт-инженеринга\n\n- **Промпт (Prompt)** - запрос или инструкция, отправляемая языковой модели\n- **Токен (Token)** - базовая единица текста, обрабатываемая моделью (может быть частью слова, словом или знаком препинания)\n- **Температура (Temperature)** - параметр, контролирующий случайность ответов модели\n- **Few-shot learning** - предоставление нескольких примеров в промпте для обучения модели на ходу\n- **Chain-of-thought (CoT)** - техника, побуждающая модель показывать ход своих рассуждений\n- **RAG (Retrieval-Augmented Generation)** - подход, дополняющий генерацию модели извлечением информации из внешних источников\n- **Jailbreaking** - попытка обойти встроенные ограничения безопасности модели\n- **Hallucination** - когда модель генерирует фактически неверную информацию, представляя ее как истинную"
}
